package chapter06.EX01;

public class Using_Class01 {

	public static void main(String[] args) {
		//절차지향 프로그램		: C언어, 시간의 순서에 따라서 프로그래밍하는 방식
			//람보르기니: 한 공장에서 모든 제품을 완성, 성능 좋다, 제작하기 어렵다
			//고장이 났을 때 생산된 공장에서 제품을 모두 분해 후 다시 제작
		
		//객체지향 프로그램(OOP)	: Java, 프로그램을 객체, 객체, 객체
			//일반 자동차: 자동차의 부품을 표준화해서 타이어(객체), 유리(객체), 엔진(객체), 핸들(객체)
			//			객체를 조립하는 형식으로 제품을 완성
			//			개발과 수리가 모두 쉽다 (고장이 나면 해당 부품을 교체하면 되기 때문)
		
		/* 클래스: 사용자가 직접 만드는 함수
		 * 1. 클래스 내부 요소
		 * 	필드 - 함수가 만들어지는 공간
		 * 	생성자 - 함수의 이름
		 * 	메소드 - 동작
		 * 	이너클래스(내부 클래스) - 함수 안에 존재하는 클래스(ex. 피자, 반지름)
		 * 
		 * 2. 클래스 외부 요소
		 * 	패키지
		 * 	임포트
		 * 	외부 클래스
		 */
	}

}
